app/controllers/groups_controller.rb

SELECT * FROM "groups" ORDER BY upper(name) DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "groups"
---
  def index
    if params[:order_by] then
    	if params[:direction]
#  @groups = Group.paginate :page => params[:page], :per_page => 10, :order => 'upper(name) ASC'
      		@groups = Group.paginate :page => params[:page], :per_page => 10, :order => "#{params[:order_by]} #{params[:direction]}"

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def show
    @group = Group.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
---
  def edit
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "updated_at", "created_at") VALUES('new group', '2009-02-28 23:11:49', '2009-02-28 23:11:49')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
UPDATE "groups" SET "name" = 'Apples', "updated_at" = '2009-03-01 21:00:23' WHERE "id" = 2
---
  def update
    @group = Group.find(params[:id])

    respond_to do |format|
      if @group.update_attributes(params[:group])

SELECT * FROM "groups" WHERE ("groups"."id" = 953125641)
DELETE FROM "groups" WHERE "id" = 953125641
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy